app/Controllers/ProdukCrud.php

    public function index(){

        $session = session();
        $data['teks'] = "Welcome back, ".$session->get('user_name')."";

        $produkModel = new ProdukModel();
        $data['produksi'] = $produkModel->orderBy('id_produk', 'DESC')->findAll();
---
SELECT *
FROM `produk`
ORDER BY `id_produk` DESC