app/Controllers/UserCrud.php

    public function index(){
        $session = session();
        $data['teks'] = "Welcome back, ".$session->get('user_name')."";
        $userModel = new UserModel();
        $data['users'] = $userModel->orderBy('user_id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `user_id` DESC

    public function singleUser($id = null){
        $userModel = new UserModel();
        $data['user_obj'] = $userModel->where('user_id', $id)->first();
---
SELECT *
FROM `users`
WHERE `user_id` = '5'
 LIMIT 1

    public function update(){
        $userModel = new UserModel();
        $id = $this->request->getVar('id');

        $validation = $this->validate([
            'file_upload' => 'uploaded[file_upload]|mime_in[file_upload,image/jpg,image/jpeg,image/gif,image/png]|max_size[file_upload,300]'
        ]);

        if ($validation == FALSE) {
                $data = array(
                    'user_name' => $this->request->getVar('name'),
                    'user_email'  => $this->request->getVar('email'),
                    'user_password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
                );
        } else {

            $dt = $userModel->where('user_id', $id)->first();
---
SELECT *
FROM `users`
WHERE `user_id` = '30'
 LIMIT 1

            'user_name' => $this->request->getVar('name'),
            'user_email'  => $this->request->getVar('email'),
        ];*/
        $userModel->update($id, $data);
---
UPDATE `users` SET `user_name` = 'Resyakila Sutayta Wibisono ed', `user_email` = 'resyakila@mailed.com', `user_password` = '$2y$10$3M53U634dTVwHAhgr6K7/OLGXLwWg0Hrl8j9beD3ntsHDL4f2DaTi', `img_file` = '1693849733_14d7cb19516c070f30c5.jpg'
WHERE `users`.`user_id` IN ('30')